do 

function run(msg, matches) 
  return [[ 
ســورس ديف اسيل 👮🏻✋🏻 DEVASL_V1

         🕳 جمـيع الاوامـر شـغاله 🕳     

➖🕳➖🕳➖🕳➖🕳➖🕳➖🕳
🎗 م1    ⚡️لـعرض اوامر الاولـيه ⚡️

🎗 م2    ⚡️لـعرض اوامـر الاداريـه ⚡️

🎗 م3    ⚡️لـعرض اوامر الحمـايه ⚡️

🎗 م المطور ⚡️لعـرض اوامر المـطور ⚡️
➖🕳➖🕳➖🕳➖🕳➖🕳➖🕳
◤ ســـــورس DEVASL_V1

🎗مــطور الــسـورس
⚡️@DEV_ALBADRY
⚡️@MAHDI_ALBADRY
🎗بــوت الــتواصـل
⚡️@OLLILLO_bot

🎗قـناه الســورس
⚡️@DEVASL
◢
➖🕳➖🕳➖🕳➖🕳➖🕳➖🕳

]] 

end 

return { 
description = "Help list", 
usage = "Help list", 
patterns = { 
"^(الاوامر)$", 
}, 
run = run 
} 
end
--[[
#
#ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#:((                                 >>
########<< For More Information             >>
#<< CHANAL TΞΛM DєVASL: @DEVASL      >>
#<< Dev MAHDI ALBADRY: @DEV_ALBADRY  >>
#<< DEV OR ACC: @MAHDI_ALBADRY       >>
#<< DEV BOT : @OLLILLO_BOT           >>      
#<< Version: V1                      >>
#:))                                 >>
#ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#
]]