
do

function run(msg, matches)
return [[

🎀الـبـوت الـذي يـعـمـل عـلـى مـجـمـوعـات الـسـوبـر 

🎀يـعـمـل الـبـوت عـلـى مـجـمـوعـات سـوبـر تـصـل الـى 5 K عـضـو 

   ≪ تـم صـنـع الـبـوت بـواسـطـه الـمـطـور ≫
   
                      『  @DEV_ALBADRY  』
                      『 @MAHDI_ALBADRY 』
                      

                      
🎀كـل مـا هـو جـديـد عـلـى قـنـاه الـسـورس 
                      
                      [ @DEVASL ]
 
]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"^(المطور)$",
},
run = run 
}
end
